# Задача 24
# В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой
# грядке, причем кусты высажены только по окружности. Таким образом, у каждого
# куста есть ровно два соседних. Всего на грядке растет N кустов.
# Семинар 4 2
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.
from random import randint
n = int(input('Введите число грядок: '))
lst_1=list()
maxi =int(0)
for i in range(n):
    lst_1.append(randint(3,15))
for i in range(n-2):
    if lst_1[i]+lst_1[i+1]+lst_1[i+2]>maxi:
        maxi=lst_1[i]+lst_1[i+1]+lst_1[i+2]
print(lst_1)    
print(maxi)