# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
# Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает,
# Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв)
# в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, если во фразе несколько слов,
# то они разделяются дефисами. Фразы отделяются друг от друга пробелами. Стихотворение  Винни-Пух вбивает в программу с клавиатуры.
# В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке

# *Пример:*

# **Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да
#     **Вывод:** Парам пам-пам

def poems(song):
    if __name__ == '__main__':
        list_A = list()
        for i in range(len(song)):
            n = sum(map(lambda x: 1 if x == 'а' else 0, song[i]))
            list_A.append(n)
        if len(set(list_A)) == 1:
            print('Парам пам-пам')
        else:
            print('Пам парам')
            
poems_Vinni = list(map(str, input().split()))
poems(poems_Vinni)
